13/data/attachments/290856189f07f7e2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d6d20aef-cbeb-4436-a67d-fa103779ff51</nif:username>
            <nif:friendToBeAdded>Jamie_out_Friend_48670_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>